#include <iostream>

using namespace std;
int main() {
	int r, p, q;
	cout << "Введіть 0 або 1 для r,p,q"; cin >> p >> q >> r;
	int f1 = 0, f2 = 0, f3 = 0, f4 = 0, f5 = 0, f6 = 0, f7 = 0, f8 = 0;
	//p(заперечення)
	if (p == 0)
		f1 = 1;
	//r^p(заперечення)
	if (r == 1 && !p)
		f2 = 1;
	//p-> q
	if (!p || q == 0)
		f3 = 1;
	//p ^ r
	if (p == 0 && r == 1)
		f4 = 1;
	if (q == 0 || r == 1)
		f5 = 1;
	if (p == 0 || r == 1)
		f6 = 1;
	if (!(r == 1 && !p) || (p == 0 && q == 0))
		f7 = 1;
	if ((p == 0 && r == 1) || (q == 0 || r == 1))
		f8 = 1;
	if (p == 1)
		f1 = 0;
	if (r == 1 && !p)
		f2 = 0;
	if (!p || q == 1)
		f3 = 1;
	if (p == 1 && r == 1)
		f4 = 1;
	if (q == 1 || r == 1)
		f5 = 1;
	if (p == 1 || r == 1)
		f6 = 1;
	if (!(r == 1 && !p) || (p == 1 || q == 1))
		f7 = 1;
	if (!(p == 1 && r == 1) || (q == 1 || r == 1))
		f8 = 1;
	if (p == 0)
		f1 = 1;
	if (r == 0 && !p)
		f2 = 1;
	if (!p || q == 0)
		f3 = 1;
	if (p == 0 && r == 0)
		f4 = 1;
	if (q == 0 || r == 0)
		f5 = 1;
	if (p == 0 || r == 0)
		f6 = 0;
	if (!(r == 0 && !p) || (!p || q == 0))
		f7 = 1;
	if (!(p == 0 && r == 0) || (q == 0 || r == 0))
		f8 = 1;
	if (p == 1)
		f1 = 0;
	if (r == 0 && !p)
		f2 = 1;
	if (!p || q == 1)
		f3 = 1;
	if (p == 0 && r == 0)
		f4 = 0;
	if (q == 1 || r == 0)
		f5 = 0;
	if (p == 0 || r == 0)
		f6 = 0;
	if (!(r == 0 && !p) || (!p || q == 1))
		f7 = 1;
	if (!(p == 0 && r == 0) || (q == 1 || r == 0))
		f8 = 1;
	if (p == 0)
		f1 = 1;
	if (r == 0 && !p)
		f2 = 0;
	if (!p || q == 0)
		f3 = 0;
	if (p == 1 && r == 0)
		f4 = 0;
	if (q == 0 || r == 0)
		f5 = 0;
	if (p == 1 || r == 0)
		f6 = 0;
	if (!(r == 0 && !p) || (!p || q == 0))
		f7 = 1;
	if (!(p == 1 && r == 0) || (q == 0 || r == 0))
		f8 = 1;
	if (p == 0)
		f1 = 1;
	if (r == 1 && !p)
		f2 = 0;
	if (!p || q == 0)
		f3 = 0;
	if (p == 1 && r == 1)
		f4 = 1;
	if (q == 0 || r == 1)
		f5 = 1;
	if (p == 1 || r == 1)
		f6 = 1;
	if (!(r == 1 && !p) || (!p || q == 0))
		f7 = 1;
	if (!(p == 1 && r == 1) || (q == 0 || r == 1))
		f8 = 1;
	if (p == 0)
		f1 = 1;
	if (r == 1 && !p)
		f2 = 1;
	if (!p || q == 1)
		f3 = 1;
	if (p == 0 && r == 1)
		f4 = 1;
	if (q == 1 || r == 1)
		f5 = 1;
	if (p == 0 || r == 1)
		f6 = 1;
	if (!(r == 1 && !p) || (!p || q == 1))
		f7 = 1;
	if (!(p == 0 && r == 1) || (q == 1 || r == 1))
		f8 = 1;
	if (p == 0)
		f1 = 1;
	if (r == 0 && !p)
		f2 = 1;
	if (!p || q == 1)
		f3 = 1;
	if (p == 1 && r == 0)
		f4 = 0;
	if (q == 1 || r == 0)
		f5 = 0;
	if (p == 1 || r == 0)
		f6 = 0;
	if (!(r == 0 && !p) || (!p || q == 1))
		f7 = 1;
	if (!(p == 1 && r==0) || (q == 1 || r == 0))
		f8 = 1;

	cout << "f1=" << f1 << endl;
	cout << "f2=" << f2 << endl;
	cout << "f3=" << f3 << endl;
	cout << "f4=" << f4 << endl;
	cout << "f5=" << f5 << endl;
	cout << "f6=" << f6 << endl;
	cout << "f7=" << f7 << endl;
	cout << "f8=" << f8 << endl;

	return 0;
}
